a = 1
y = 15/13
b = 10/7
z = 4/14
Ø = (a+z)/2
ø = (b+y)/2

function p(w,x)
    ((w^x)*2.718^-w)/(factorial(x))
end

draw = p(Ø,0)*p(ø,0)+p(Ø,1)*p(ø,1)+p(Ø,2)*p(ø,2)+p(Ø,3)*p(ø,3)+p(Ø,4)*p(ø,4)+p(Ø,5)*p(ø,5)

home = p(Ø,5)*p(ø,4)+p(Ø,5)*p(ø,3)+p(Ø,5)*p(ø,3)+p(Ø,5)*p(ø,2)+p(Ø,5)*p(ø,1)+p(Ø,5)*p(ø,0) +
p(Ø,4)*p(ø,3)+p(Ø,4)*p(ø,2)+p(Ø,4)*p(ø,1)+p(Ø,4)*p(ø,0) +
p(Ø,3)*p(ø,2)+p(Ø,3)*p(ø,1)+p(Ø,3)*p(ø,0) +
p(Ø,2)*p(ø,1)+p(Ø,2)*p(ø,0) +
p(Ø,1)*p(ø,0)

away = p(ø,5)*p(Ø,4)+p(ø,5)*p(Ø,3)+p(ø,5)*p(Ø,3)+p(ø,5)*p(Ø,2)+p(ø,5)*p(Ø,1)+p(ø,5)*p(Ø,0) +
p(ø,4)*p(Ø,3)+p(ø,4)*p(Ø,2)+p(ø,4)*p(Ø,1)+p(ø,4)*p(Ø,0) +
p(ø,3)*p(Ø,2)+p(ø,3)*p(Ø,1)+p(ø,3)*p(Ø,0) +
p(ø,2)*p(Ø,1)+p(ø,2)*p(Ø,0) +
p(ø,1)*p(Ø,0)

tot = draw + home + away
dtot = draw/tot
htot = (home/tot)*1.025
atot = (away/tot)*.975

println("Home: $htot Away: $atot Draw:$dtot")
